app/Http/Controllers/PostController.php

select * from "posts"
---
    public function index()
    {
        $posts = Post::paginate();

insert into "posts" ("content", "updated_at", "created_at") values ('qwe qwe qwe', '2023-04-18 04:05:45', '2023-04-18 04:05:45') returning "id"
---
    public function store(StorePostRequest $request)
    {
        Post::create($request->validated());